doc/isolation-notes.org
#+TITLE: Transaction and Isolation Notes
#+OPTIONS: num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>
#+OPTIONS: ^:nil

* Postmodern transaction calls with transaction names and isolation levels
  :PROPERTIES:
  :ID:       0e957d25-fa0c-4045-9bea-7ae14ca9a9d2
  :END:
Transactions are one or more statements wrapped together which either all
succeed and are "committed" or none of them succeed, in which case any state
changes are rolled back to the beginning of the transaction. In the case of
postmodern, there are two main macros available for use:

- with-transaction (for general use)
- with-logical-transaction (for nested transactions and savepoints)

When you get into situations where you expect concurrent transactions, you
can specify the whether the transaction is allowed only read access or
both read and write access to the database table rows and you can specify
either the default isolation level or a specific isolation level for that
transaction. If you need more information on what isolation levels are, and
when to use them, see below.

Postgresql defaults to the read committed isolation level with
read and write access. This is also postmodern's default, but that can be
changed by setting postmodern:*isolation-level* to your desired setting.

The available settings in postmodern follow the sql standard are:

- :read-committed-rw (read committed with read and write)
- :read-committed-ro (read committed with read only)
- :repeatable-read-rw (repeatable read with read and write)
- :repeatable-read-ro (repeatable read with read only)
- :serializable (serializable with read and write)

(Ok. "Loosely" follows the sql standard because we combine read-write and
read-only constraints with the sql standard isolation levels. There is one
unsafe isolation level defined by the standard, but neither postgresql nor
any other major database implements it.)

Postmodern generally provides the ability to specify the name of a transaction
and the isolation level per the key words above. Examples of use are below
and "george" is used as the name of the transaction (not quoted or as a string):
#+BEGIN_SRC lisp
(with-transaction ()
  (execute (:insert-into 'test-data :set 'value 77)))

(with-transaction (george)
  (execute (:insert-into 'test-data :set 'value 22)))

(with-transaction (george :read-committed-rw)
  (execute (:insert-into 'test-data :set 'value 33)))

(with-transaction (:serializable)
  (execute (:insert-into 'test-data :set 'value 44)))

(with-logical-transaction ()
  (execute (:insert-into 'test-data :set 'value 77)))

(with-logical-transaction (george)
  (execute (:insert-into 'test-data :set 'value 22)))

(with-logical-transaction (george :read-committed-rw)
  (execute (:insert-into 'test-data :set 'value 33)))

(with-logical-transaction (:serializable)
  (execute (:insert-into 'test-data :set 'value 44)))
#+END_SRC

* Introduction to ACID, Transactions and Isolation Levels
  :PROPERTIES:
  :ID:       137be1d0-de95-4291-ab36-dc2ceabfbc0d
  :END:

Databases like Postgresql are not simply data storage, they are
transaction management systems. In the context of transactions with multiple
operations within the transaction, either all of them commit or none of them
commit (the transaction is rolled back). Transactions include single
statement transactions as well as multiple statement transactions that are
wrapped inside BEGIN – COMMIT Commands. (In the case of postmodern macros
with-transaction and with-logical-transaction, the commit command is handled
for you automatically.)

You may have heard of databases being "ACID" compliant or having ACID
functionality. Transactions are the “A” (Atomicity) in “ACID”.
“C” is “Consistency”, “I” is “Isolation” and “D” is “Durability”. As you can
tell, everything in ACID in designed to maintain the integrity of the data.
Without atomicity, you risk leaving data in a partial or invalid state and
everything which depends on the data will break. (And your dba will be
upset – the question is – will they then try to break you?)

Consistency ensures that every transaction will move the database from one
valid state to another valid state. Consider two users A and B signing up
with the same desired username “myname” almost simultaneously. The system
checks to see whether “myname” is in use for A. It is not, so it starts the
process of creating a record for “myname”. The system checks for B to see
whether “myname” is in use. Since it has not yet finished creating the record
for A, it appears to be available for B, so it starts the process of
creating a user record for B using “myname”. One or both can end up in an
invalid state.

You can prevent the inconsistent state by either putting a uniqueness check
on the user table for usernames or you use an isolation level like
serializable on your transactions. In either case, B’s commit will fail,
you have to restart that transaction, but the data that is now in the system
is safe and consistent..

Isolation levels define what is allowed to happen if there are two transactions
tyring to access the same data simultaneously. More on this below.

Durability means that committed transactions must stay committed, even in
the event of a crash, power loss, etc.

