doc/isolation-notes.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-05-16 Sat 15:32 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Transaction and Isolation Notes</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Transaction and Isolation Notes</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9e38018">Postmodern transaction calls with transaction names and isolation levels</a></li>
<li><a href="#org2d2f344">Introduction to ACID, Transactions and Isolation Levels</a></li>
<li><a href="#org09c84e9">Transactions</a>
<ul>
<li>
<ul>
<li><a href="#org2074f92">What happens if we nest transactions?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org631971c">The Concurrency Problem</a>
<ul>
<li><a href="#org6f957cf">Summary</a></li>
<li><a href="#orgd7826ba">Problem Explanation</a>
<ul>
<li><a href="#org580ea64">Dirty Read</a></li>
<li><a href="#org478365a">Nonrepeatable Read</a></li>
<li><a href="#orgf85ad33">Phantom Read</a></li>
<li><a href="#org6803710">For More Fun</a></li>
</ul>
</li>
<li><a href="#orgad0b61f">Isolation Levels</a>
<ul>
<li><a href="#org300588e">Read Committed Isolation Level</a></li>
<li><a href="#org281f76a">Repeatable Read Isolation Level</a></li>
<li><a href="#orgeaaa3de">Serializable Isolation Level</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0f0efcd">For Futher Reading</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org9e38018" class="outline-2">
<h2 id="org9e38018">Postmodern transaction calls with transaction names and isolation levels</h2>
<div class="outline-text-2" id="text-org9e38018">
<p>
Transactions are one or more statements wrapped together which either all
succeed and are "committed" or none of them succeed, in which case any state
changes are rolled back to the beginning of the transaction. In the case of
postmodern, there are two main macros available for use:
</p>

<ul class="org-ul">
<li>with-transaction (for general use)</li>
<li>with-logical-transaction (for nested transactions and savepoints)</li>
</ul>

<p>
When you get into situations where you expect concurrent transactions, you
can specify the whether the transaction is allowed only read access or
both read and write access to the database table rows and you can specify
either the default isolation level or a specific isolation level for that
transaction. If you need more information on what isolation levels are, and
when to use them, see below.
</p>

<p>
Postgresql defaults to the read committed isolation level with
read and write access. This is also postmodern's default, but that can be
changed by setting postmodern:*isolation-level* to your desired setting.
</p>

<p>
The available settings in postmodern follow the sql standard are:
</p>

<ul class="org-ul">
<li>:read-committed-rw (read committed with read and write)</li>
<li>:read-committed-ro (read committed with read only)</li>
<li>:repeatable-read-rw (repeatable read with read and write)</li>
<li>:repeatable-read-ro (repeatable read with read only)</li>
<li>:serializable (serializable with read and write)</li>
</ul>

<p>
(Ok. "Loosely" follows the sql standard because we combine read-write and
read-only constraints with the sql standard isolation levels. There is one
unsafe isolation level defined by the standard, but neither postgresql nor
any other major database implements it.)
</p>

<p>
Postmodern generally provides the ability to specify the name of a transaction
and the isolation level per the key words above. Examples of use are below
and "george" is used as the name of the transaction (not quoted or as a string):
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00ffff;">with-transaction</span> ()
  (execute (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'test-data <span style="color: #98fb98; font-weight: bold;">:set</span> 'value 77)))

(<span style="color: #00ffff;">with-transaction</span> (george)
  (execute (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'test-data <span style="color: #98fb98; font-weight: bold;">:set</span> 'value 22)))

(<span style="color: #00ffff;">with-transaction</span> (george <span style="color: #98fb98; font-weight: bold;">:read-committed-rw</span>)
  (execute (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'test-data <span style="color: #98fb98; font-weight: bold;">:set</span> 'value 33)))

(<span style="color: #00ffff;">with-transaction</span> (<span style="color: #98fb98; font-weight: bold;">:serializable</span>)
  (execute (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'test-data <span style="color: #98fb98; font-weight: bold;">:set</span> 'value 44)))

(<span style="color: #00ffff;">with-logical-transaction</span> ()
  (execute (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'test-data <span style="color: #98fb98; font-weight: bold;">:set</span> 'value 77)))

(<span style="color: #00ffff;">with-logical-transaction</span> (george)
  (execute (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'test-data <span style="color: #98fb98; font-weight: bold;">:set</span> 'value 22)))

(<span style="color: #00ffff;">with-logical-transaction</span> (george <span style="color: #98fb98; font-weight: bold;">:read-committed-rw</span>)
  (execute (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'test-data <span style="color: #98fb98; font-weight: bold;">:set</span> 'value 33)))

(<span style="color: #00ffff;">with-logical-transaction</span> (<span style="color: #98fb98; font-weight: bold;">:serializable</span>)
  (execute (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'test-data <span style="color: #98fb98; font-weight: bold;">:set</span> 'value 44)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2d2f344" class="outline-2">
<h2 id="org2d2f344">Introduction to ACID, Transactions and Isolation Levels</h2>
<div class="outline-text-2" id="text-org2d2f344">
<p>
Databases like Postgresql are not simply data storage, they are
transaction management systems. In the context of transactions with multiple
operations within the transaction, either all of them commit or none of them
commit (the transaction is rolled back). Transactions include single
statement transactions as well as multiple statement transactions that are
wrapped inside BEGIN – COMMIT Commands. (In the case of postmodern macros
with-transaction and with-logical-transaction, the commit command is handled
for you automatically.)
</p>

<p>
You may have heard of databases being "ACID" compliant or having ACID
functionality. Transactions are the “A” (Atomicity) in “ACID”.
“C” is “Consistency”, “I” is “Isolation” and “D” is “Durability”. As you can
tell, everything in ACID in designed to maintain the integrity of the data.
Without atomicity, you risk leaving data in a partial or invalid state and
everything which depends on the data will break. (And your dba will be
upset – the question is – will they then try to break you?)
</p>

<p>
Consistency ensures that every transaction will move the database from one
valid state to another valid state. Consider two users A and B signing up
with the same desired username “myname” almost simultaneously. The system
checks to see whether “myname” is in use for A. It is not, so it starts the
process of creating a record for “myname”. The system checks for B to see
whether “myname” is in use. Since it has not yet finished creating the record
for A, it appears to be available for B, so it starts the process of
creating a user record for B using “myname”. One or both can end up in an
invalid state.
</p>

<p>
You can prevent the inconsistent state by either putting a uniqueness check
on the user table for usernames or you use an isolation level like
serializable on your transactions. In either case, B’s commit will fail,
you have to restart that transaction, but the data that is now in the system
is safe and consistent..
</p>

<p>
Isolation levels define what is allowed to happen if there are two transactions
tyring to access the same data simultaneously. More on this below.
</p>

<p>
Durability means that committed transactions must stay committed, even in
the event of a crash, power loss, etc.
</p>
</div>
</div>
