doc/isolation-notes.org
* Transactions
  :PROPERTIES:
  :ID:       231f87c9-b5f4-46bb-884c-2dd3cb7d9e8f
  :END:

It is easy show the impact of transactions in action. Consider the following:

#+BEGIN_SRC lisp
(execute (:create-table test-data ((value :type integer))))

(with-transaction ()
  (execute (:insert-into 'test-data :set 'value 77)))
(query (:select '* :from 'test-data))
((77))
#+END_SRC
The postmodern macro with-transaction completes with a call to
commit-transaction. So absent any intervening actions, the transaction
will commit at the end of the form.

For purposes of the following examples, assume that we truncated
the table prior to each example so we have the same base line each time.
#+BEGIN_SRC lisp
(ignore-errors
  (with-transaction ()
    (execute (:insert-into 'test-data :set 'value 2))
    (error "no wait")))
NIL
#<SIMPLE-ERROR "no wait" {100D581653}>

(with-test-connection (query (:select '* :from 'test-data)))
NIL
#+END_SRC
This time we triggered an error before the transaction concluded. Because the
error was inside the transaction, it invalidated all statements inside the
transction and the tentative insertion never happened.
(Actually more complicated than this, but from an application developer
standpoint, we can think of it this way.)

Now lets actually give the transaction a name and make a superflous call to
commit-transaction within the transaction.
#+BEGIN_SRC lisp
(with-transaction (transaction)
  (execute (:insert-into 'test-data :set 'value 2))
  (commit-transaction transaction))

(query (:select '* :from 'test-data))
((2))
#+END_SRC
As you can see, making the unnecessary call to commit-tranaction does not
trigger the insertion twice.

We can also decide to abort the transaction without triggering an error:
#+BEGIN_SRC lisp
(with-transaction (transaction)
  (execute (:insert-into 'test-data :set 'value 44))
  (abort-transaction transaction))

(query (:select '* :from 'test-data))
NIL
#+END_SRC
As expected, the insertion was never committed due to the call to
abort-transaction.

*** What happens if we nest transactions?
    :PROPERTIES:
    :ID:       122dd6f3-321a-4a3c-b0f8-7942c1b69913
    :END:
Postgresql does not fully support nested transactions. Full support of
nested transactions would mean that a succesful sub-transaction does not get
rolled back if a parent transaction (direct or indirect) gets rolled back.

Postgresql allows the use of savepoints, which can get you to a consistent
state but means that if any transaction in a nested transaction sequence
is rolled back, then everything in the transaction is rolled back. Postmodern
provides savepoints automatically in a nested situation if you use the macro
with-logical-transaction. Postmodern also provides a macro with-savepoint
if you need to handle them manually.

If you do not use savepoints, the result of nested transactions may not be
consistent. Some or all of subtransactions may or may not get committed
if there is an error anywhere in the nest.

The [[https://www.postgresql.org/docs/10/static/sql-begin.html][official postgresql documentation]] states that "Issuing a begin when already
inside a transaction will provoke a warning message. The state of the
transaction is not affected." While this sounds like the subtransactions just
get treated as part of the outer transaction, you cannot rely on that
interpretation.

Morale of the story. If you are going to nest transactions in postmdern, use
the with-logical-transaction macro, do not use the with-transaction macro.

Now lets talk about concurrency issues and the trade-offs between different
isolation levels.

* The Concurrency Problem
  :PROPERTIES:
  :ID:       7bb2c71b-8372-4d89-80c6-d99f8aa74ef6
  :END:
