doc/isolation-notes.html

<div id="outline-container-org09c84e9" class="outline-2">
<h2 id="org09c84e9">Transactions</h2>
<div class="outline-text-2" id="text-org09c84e9">
<p>
It is easy show the impact of transactions in action. Consider the following:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(execute (<span style="color: #98fb98; font-weight: bold;">:create-table</span> test-data ((value <span style="color: #98fb98; font-weight: bold;">:type</span> integer))))

(<span style="color: #00ffff;">with-transaction</span> ()
  (execute (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'test-data <span style="color: #98fb98; font-weight: bold;">:set</span> 'value 77)))
(query (<span style="color: #98fb98; font-weight: bold;">:select</span> '* <span style="color: #98fb98; font-weight: bold;">:from</span> 'test-data))
((77))
</pre>
</div>
<p>
The postmodern macro with-transaction completes with a call to
commit-transaction. So absent any intervening actions, the transaction
will commit at the end of the form.
</p>

<p>
For purposes of the following examples, assume that we truncated
the table prior to each example so we have the same base line each time.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00ffff;">ignore-errors</span>
  (<span style="color: #00ffff;">with-transaction</span> ()
    (execute (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'test-data <span style="color: #98fb98; font-weight: bold;">:set</span> 'value 2))
    (<span style="color: #cd5c5c; font-weight: bold;">error</span> <span style="color: #cd8162;">"no wait"</span>)))
NIL
#&lt;SIMPLE-ERROR <span style="color: #cd8162;">"no wait"</span> {100D581653}&gt;

(<span style="color: #00ffff;">with-test-connection</span> (query (<span style="color: #98fb98; font-weight: bold;">:select</span> '* <span style="color: #98fb98; font-weight: bold;">:from</span> 'test-data)))
NIL
</pre>
</div>
<p>
This time we triggered an error before the transaction concluded. Because the
error was inside the transaction, it invalidated all statements inside the
transction and the tentative insertion never happened.
(Actually more complicated than this, but from an application developer
standpoint, we can think of it this way.)
</p>

<p>
Now lets actually give the transaction a name and make a superflous call to
commit-transaction within the transaction.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00ffff;">with-transaction</span> (transaction)
  (execute (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'test-data <span style="color: #98fb98; font-weight: bold;">:set</span> 'value 2))
  (commit-transaction transaction))

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> '* <span style="color: #98fb98; font-weight: bold;">:from</span> 'test-data))
((2))
</pre>
</div>
<p>
As you can see, making the unnecessary call to commit-tranaction does not
trigger the insertion twice.
</p>

<p>
We can also decide to abort the transaction without triggering an error:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00ffff;">with-transaction</span> (transaction)
  (execute (<span style="color: #98fb98; font-weight: bold;">:insert-into</span> 'test-data <span style="color: #98fb98; font-weight: bold;">:set</span> 'value 44))
  (abort-transaction transaction))

(query (<span style="color: #98fb98; font-weight: bold;">:select</span> '* <span style="color: #98fb98; font-weight: bold;">:from</span> 'test-data))
NIL
</pre>
</div>
<p>
As expected, the insertion was never committed due to the call to
abort-transaction.
</p>
</div>

<div id="outline-container-org2074f92" class="outline-4">
<h4 id="org2074f92">What happens if we nest transactions?</h4>
<div class="outline-text-4" id="text-org2074f92">
<p>
Postgresql does not fully support nested transactions. Full support of
nested transactions would mean that a succesful sub-transaction does not get
rolled back if a parent transaction (direct or indirect) gets rolled back.
</p>

<p>
Postgresql allows the use of savepoints, which can get you to a consistent
state but means that if any transaction in a nested transaction sequence
is rolled back, then everything in the transaction is rolled back. Postmodern
provides savepoints automatically in a nested situation if you use the macro
with-logical-transaction. Postmodern also provides a macro with-savepoint
if you need to handle them manually.
</p>

<p>
If you do not use savepoints, the result of nested transactions may not be
consistent. Some or all of subtransactions may or may not get committed
if there is an error anywhere in the nest.
</p>

<p>
The <a href="https://www.postgresql.org/docs/10/static/sql-begin.html">official postgresql documentation</a> states that "Issuing a begin when already
inside a transaction will provoke a warning message. The state of the
transaction is not affected." While this sounds like the subtransactions just
get treated as part of the outer transaction, you cannot rely on that
interpretation.
</p>

<p>
Morale of the story. If you are going to nest transactions in postmdern, use
the with-logical-transaction macro, do not use the with-transaction macro.
</p>

<p>
Now lets talk about concurrency issues and the trade-offs between different
isolation levels.
</p>
</div>
</div>
</div>

<div id="outline-container-org631971c" class="outline-2">
<h2 id="org631971c">The Concurrency Problem</h2>
<div class="outline-text-2" id="text-org631971c">
</div>
