doc/isolation-notes.org
** Summary
   :PROPERTIES:
   :ID:       69a27208-6951-4bdf-9792-f78a9c0784b1
   :END:
Consider when you have multiple concurrent transactions or multiple concurrent
database events. These create potential race conditions as well as potential
overwrite issues, creating hard to find bugs. The base problem is easy to
understand – what happens when two users try to access the same row of data
concurrently.

Think about how databases using MVCC (multi-version concurrency control)
execute statements inside a transaction. The data generated by the transaction
is kept off to the side, away from other data until the entire transaction
can be committed. Once it is committed, it becomes visible to all future
transactions and the old row which it may have edited becomes marked as
invalid. The invalid row still exists in the system until the next VACUUM.
Of course, this does not mean that the system prevents user B from overwriting
user A’s changes from an hour ago. We are solely focused on concurrency issues
here.

All committed transactions are written to the write-ahead log (WAL or “xlog”).
In case of trouble, Postgresql can replay the WAL log to recover changes that
did not get into the actual data files. Postgresql also has a commit
log “pg_xact” which summarizes transactions and whether the transaction
committed or aborted. Any transaction that was a read only transaction is
never written to the WAL or commit logs. As it was not intended to modify any
data, there is no need. However, if the transaction is aborted, that fact will
still be noted in the WAL and commit logs. (You can also configure postgresql
to log all queries, but that is not the default.)

Now think about the situation at a little more granular level.

- If two transactions read the old state and then perform changes concurrently, the last write transaction will be effective and the previous write transaction may be lost unless you have explicit locking.

- If two transactions with multiple statements read the old state and then both transactions perform changes concurrently, you may end up in an inconsistent data state.

- If one transaction reads the old state and prepares to make a change based on the value of the old state, but another transaction modifies the old state before the first transaction finishes, the first transaction has now made a decision based on bad data.

- If you execute the same query twice and get back more or fewer elements in the second execution than the first execution.

Depending on your application, these may or may not be something that you need
to worry about.

The SQL standard actually has four transaction isolation levels.
Postgresql only implements three of those - "Read Uncommitted" is not
implemented and the default transaction level for Postgresql is “read committed”.
Postgresql allows the user to specify the isolation level of a transaction
on a transaction by transaction basis. As you might expect, there are trade-offs.
Stronger isolation levels have more overhead and may trigger more transactions
that need to be repeated (and therefore you will have to write the code to
handle the necessary repeats).

We explain this table just below:

| Isolation Level  | Dirty Read   | Nonrepeatable Read | Phantom Read                                       | Serialization Anomaly |
|------------------+--------------+--------------------+----------------------------------------------------+-----------------------|
| Read Uncommitted | Allowed      | Possible           | Possible                                           | Possible              |
| Read Committed * | Not Possible | Possible           | Possible                                           | Possible              |
| Repeatable Read  | Not Possible | Not Possible       | Allowed by SQL Standard, not allowed in Postgresql | Possible              |
| Serializable     | Not Possible | Not Possible       | Not Possible                                       | Not Possible          |

** Problem Explanation
   :PROPERTIES:
   :ID:       260dd433-6395-4823-8e4a-0c1c93758b4d
   :END:
*** Dirty Read
    :PROPERTIES:
    :ID:       c58c2764-eb19-4b3d-882c-ffc610ee0dbd
    :END:
A Dirty Read is a transaction reads data written by a concurrent uncommitted
transaction. You can specify a transaction as having a “Read Uncommitted”
level, but Postgresql will internally just give you a “Read Committed”
isolation level.

Assume sales are 2100 at the beginning
| Transaction 1                                    | Transaction 2                                                    |
| BEGIN                                            | BEGIN                                                            |
| (:select 'sales :from 'table1 :where (:= 'id 21) |                                                                  |
|                                                  | (:update 'table1 :set 'sales 2200 :where (:= 'id 21)) ;no commit |
| (:select 'sales :from 'table1 :where (:= 'id 21) |                                                                  |
| END                                              | END                                                              |

The second select will read sales as 2200 even though Transaction 2 did not
fully commit.

*** Nonrepeatable Read
    :PROPERTIES:
    :ID:       89ec9112-ea1b-4e53-a2c4-252189ac074a
    :END:
A Nonrepeatable read is a transaction re-reads data it has previously read and
finds the data has been modified by another transaction that committed since
the initial read.

Assume sales are 2100 at the beginning
| Transaction 1                                    | Transaction 2                                                    |
| BEGIN                                            | BEGIN                                                            |
| (:select 'sales :from 'table1 :where (:= 'id 21) |                                                                  |
|                                                  | (:update 'table1 :set 'sales 2200 :where (:= 'id 21))            |
|                                                  | COMMIT;                                                          |
| (:select 'sales :from 'table1 :where (:= 'id 21) |                                                                  |
| END                                              | END                                                              |

The second select will read sales as 2200. At least transaction 2 actually
committed first.

If you are just trying to avoid lost updates, you can use row level locks
with select FOR UPDATE under read committed. That avoids the update being
lost or aborted. Of course, now you need to worry about how to handle
situations where one transaction gets stalled and holds a transaction too long.

For select statements, you can add a row level lock by adding FOR SHARE to the
end of the SELECT. For updates, use FOR UPDATE. In postmodern, if you are using
s-sql, you can include :for-share or :for-update in the select statement. E.g.

#+BEGIN_SRC lisp
(query (:for-update (:select :* :from 'foo 'bar 'baz) :of 'bar 'baz :nowait))
#+END_SRC
See [[file:s-sql.html]] for further details.

