doc/isolation-notes.html
<div id="outline-container-org6f957cf" class="outline-3">
<h3 id="org6f957cf">Summary</h3>
<div class="outline-text-3" id="text-org6f957cf">
<p>
Consider when you have multiple concurrent transactions or multiple concurrent
database events. These create potential race conditions as well as potential
overwrite issues, creating hard to find bugs. The base problem is easy to
understand – what happens when two users try to access the same row of data
concurrently.
</p>

<p>
Think about how databases using MVCC (multi-version concurrency control)
execute statements inside a transaction. The data generated by the transaction
is kept off to the side, away from other data until the entire transaction
can be committed. Once it is committed, it becomes visible to all future
transactions and the old row which it may have edited becomes marked as
invalid. The invalid row still exists in the system until the next VACUUM.
Of course, this does not mean that the system prevents user B from overwriting
user A’s changes from an hour ago. We are solely focused on concurrency issues
here.
</p>

<p>
All committed transactions are written to the write-ahead log (WAL or “xlog”).
In case of trouble, Postgresql can replay the WAL log to recover changes that
did not get into the actual data files. Postgresql also has a commit
log “pg_xact” which summarizes transactions and whether the transaction
committed or aborted. Any transaction that was a read only transaction is
never written to the WAL or commit logs. As it was not intended to modify any
data, there is no need. However, if the transaction is aborted, that fact will
still be noted in the WAL and commit logs. (You can also configure postgresql
to log all queries, but that is not the default.)
</p>

<p>
Now think about the situation at a little more granular level.
</p>

<ul class="org-ul">
<li>If two transactions read the old state and then perform changes concurrently, the last write transaction will be effective and the previous write transaction may be lost unless you have explicit locking.</li>

<li>If two transactions with multiple statements read the old state and then both transactions perform changes concurrently, you may end up in an inconsistent data state.</li>

<li>If one transaction reads the old state and prepares to make a change based on the value of the old state, but another transaction modifies the old state before the first transaction finishes, the first transaction has now made a decision based on bad data.</li>

<li>If you execute the same query twice and get back more or fewer elements in the second execution than the first execution.</li>
</ul>

<p>
Depending on your application, these may or may not be something that you need
to worry about.
</p>

<p>
The SQL standard actually has four transaction isolation levels.
Postgresql only implements three of those - "Read Uncommitted" is not
implemented and the default transaction level for Postgresql is “read committed”.
Postgresql allows the user to specify the isolation level of a transaction
on a transaction by transaction basis. As you might expect, there are trade-offs.
Stronger isolation levels have more overhead and may trigger more transactions
that need to be repeated (and therefore you will have to write the code to
handle the necessary repeats).
</p>

<p>
We explain this table just below:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Isolation Level</th>
<th scope="col" class="org-left">Dirty Read</th>
<th scope="col" class="org-left">Nonrepeatable Read</th>
<th scope="col" class="org-left">Phantom Read</th>
<th scope="col" class="org-left">Serialization Anomaly</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Read Uncommitted</td>
<td class="org-left">Allowed</td>
<td class="org-left">Possible</td>
<td class="org-left">Possible</td>
<td class="org-left">Possible</td>
</tr>

<tr>
<td class="org-left">Read Committed *</td>
<td class="org-left">Not Possible</td>
<td class="org-left">Possible</td>
<td class="org-left">Possible</td>
<td class="org-left">Possible</td>
</tr>

<tr>
<td class="org-left">Repeatable Read</td>
<td class="org-left">Not Possible</td>
<td class="org-left">Not Possible</td>
<td class="org-left">Allowed by SQL Standard, not allowed in Postgresql</td>
<td class="org-left">Possible</td>
</tr>

<tr>
<td class="org-left">Serializable</td>
<td class="org-left">Not Possible</td>
<td class="org-left">Not Possible</td>
<td class="org-left">Not Possible</td>
<td class="org-left">Not Possible</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd7826ba" class="outline-3">
<h3 id="orgd7826ba">Problem Explanation</h3>
<div class="outline-text-3" id="text-orgd7826ba">
</div>
<div id="outline-container-org580ea64" class="outline-4">
<h4 id="org580ea64">Dirty Read</h4>
<div class="outline-text-4" id="text-org580ea64">
<p>
A Dirty Read is a transaction reads data written by a concurrent uncommitted
transaction. You can specify a transaction as having a “Read Uncommitted”
level, but Postgresql will internally just give you a “Read Committed”
isolation level.
</p>

<p>
Assume sales are 2100 at the beginning
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Transaction 1</td>
<td class="org-left">Transaction 2</td>
</tr>

<tr>
<td class="org-left">BEGIN</td>
<td class="org-left">BEGIN</td>
</tr>

<tr>
<td class="org-left">(:select 'sales :from 'table1 :where (:= 'id 21)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">(:update 'table1 :set 'sales 2200 :where (:= 'id 21)) ;no commit</td>
</tr>

<tr>
<td class="org-left">(:select 'sales :from 'table1 :where (:= 'id 21)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">END</td>
<td class="org-left">END</td>
</tr>
</tbody>
</table>

<p>
The second select will read sales as 2200 even though Transaction 2 did not
fully commit.
</p>
</div>
</div>

<div id="outline-container-org478365a" class="outline-4">
<h4 id="org478365a">Nonrepeatable Read</h4>
<div class="outline-text-4" id="text-org478365a">
<p>
A Nonrepeatable read is a transaction re-reads data it has previously read and
finds the data has been modified by another transaction that committed since
the initial read.
</p>

<p>
Assume sales are 2100 at the beginning
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Transaction 1</td>
<td class="org-left">Transaction 2</td>
</tr>

<tr>
<td class="org-left">BEGIN</td>
<td class="org-left">BEGIN</td>
</tr>

<tr>
<td class="org-left">(:select 'sales :from 'table1 :where (:= 'id 21)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">(:update 'table1 :set 'sales 2200 :where (:= 'id 21))</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">COMMIT;</td>
</tr>

<tr>
<td class="org-left">(:select 'sales :from 'table1 :where (:= 'id 21)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">END</td>
<td class="org-left">END</td>
</tr>
</tbody>
</table>

<p>
The second select will read sales as 2200. At least transaction 2 actually
committed first.
</p>

<p>
If you are just trying to avoid lost updates, you can use row level locks
with select FOR UPDATE under read committed. That avoids the update being
lost or aborted. Of course, now you need to worry about how to handle
situations where one transaction gets stalled and holds a transaction too long.
</p>

<p>
For select statements, you can add a row level lock by adding FOR SHARE to the
end of the SELECT. For updates, use FOR UPDATE. In postmodern, if you are using
s-sql, you can include :for-share or :for-update in the select statement. E.g.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #98fb98; font-weight: bold;">:for-update</span> (<span style="color: #98fb98; font-weight: bold;">:select</span> <span style="color: #98fb98; font-weight: bold;">:*</span> <span style="color: #98fb98; font-weight: bold;">:from</span> 'foo 'bar 'baz) <span style="color: #98fb98; font-weight: bold;">:of</span> 'bar 'baz <span style="color: #98fb98; font-weight: bold;">:nowait</span>))
</pre>
</div>
<p>
See <a href="s-sql.html">s-sql.html</a> for further details.
</p>
</div>
</div>
