doc/isolation-notes.org
*** Phantom Read
    :PROPERTIES:
    :ID:       535800ca-446a-44ed-bcc3-e45d4f12acf3
    :END:
A Phantom Read is where a transaction re-executes a query returning a set of
rows and finds that the set of rows has changed (not necessarily row 215,
but some one or more of the rows in the query set). Phantom Reads are
prevented by using the “Repeatable Read” isolation level. Row level locks
will not solve this problem.

Assume first select returns 50:

| Transaction 1                                             | Transaction 2                            |
| BEGIN                                                     | BEGIN                                    |
| (:select (:count '*) :from 'table1 :where (:= 'region 1)) |                                          |
|                                                           | (:insert-into 'table1 :set 'sales 2200)) |
|                                                           | COMMIT;                                  |
| (:select (:count '*) :from 'table1 :where (:= 'region 1)) |                                          |
| END                                                       | END                                      |

The second select will return 51. Depending on what else might be happening in
transaction 1, the difference between the number of rows at the beginning and
the number of rows at the end may cause calculations to be inconsistent
internally to the transaction.

*** For More Fun
    :PROPERTIES:
    :ID:       163779d6-8746-4aca-b192-86afe757dda8
    :END:
Now consider you have banking application A which runs in multiple sessions and
does not use transactions and the user withdraws 100 from each of two sessions
and the balance started at 300.

| Session 1                                                 | Session 2                                                 |
| (:select 'balance :from 'accounts :where (:= 'user-id 1)) |                                                           |
|                                                           | (:select 'balance :from 'accounts :where (:= 'user-id 1)) |
| Application calculates the balance should be 200          |                                                           |
| (:update 'accounts :set 'balance 200)                     |                                                           |
|                                                           | Application calculates the balance should be 200          |
|                                                           | (:update 'accounts :set 'balance 200)                     |

At this point the application has subtracted 200 (100 in each session), but
the account balance still shows 200. Transactions would not have made a
difference.

Now implemented slightly differently:
| Session 1                                                 | Session 2                                                 |
| (:select 'balance :from 'accounts :where (:= 'user-id 1)) |                                                           |
|                                                           | (:select 'balance :from 'accounts :where (:= 'user-id 1)) |
| (:update 'accounts :set 'balance (:- 'balance 100))       |                                                           |
|                                                           | (:update 'accounts :set 'balance (:- 'balance 100))       |

Do you know what the balance is now? It should be 100 because you put the
calculation back into the database where it belongs. But life gets more
complicated than these simple examples. Complex queries and updates provide
more possibilities for concurrent transactions to generate conflicting,
leading to solutions such as "row level locking" and "isolation levels".

** Isolation Levels
   :PROPERTIES:
   :ID:       9f177e51-2c41-40a6-b4ef-a11728acee50
   :END:
The official postgresql documentation can be found [[https://www.postgresql.org/docs/current/static/transaction-iso.html][here]].

*** Read Committed Isolation Level
    :PROPERTIES:
    :ID:       78bb8e9e-63cd-4564-aa87-1e31c398ed67
    :END:
Read Committed is the default isolation level in Postgresql. In general
it has the best balance between locking and performance. This isolation level
means that the existing row is read after the transaction is completed but not
yet written. If the row has not changed, then the transaction is executed. If
the row has changed from when it started building the transaction, then it
starts the transaction over again.

The “Read Committed” default isolation level is safe when you are concurrently
reading. If there are multiple select statements in a single transaction, each
select statement will have its own snapshot of the database (which might not
be the same if another transaction is concurrently modifying the database).
The “Read Committed” isolation level is not necessarily safe for concurrent
updates. In other words, the concurrent updates would be performed serially,
potentially surprising the user whose commit is overridden. Update and
Delete statements in a “Read Committed” isolation level will create a
snapshot of the database, use that snapshot to find the rows matching the
where clause and then try to lock that row of the snapshot. If any rows are
already locked by an update or delete statement in another transaction, the
update or delete statement will wait for the other transaction to commit or
abort. If it commits, the update or delete will re-evaluate the where clause
on the new version of the row to determine whether it needs to be modified.

Assume our banking problem using transactions at the Postgresql default
isolation level of "read committed".

| Session 1                                                 | Session 2                                                            |
| BEGIN                                                     | BEGIN                                                                |
| (:select 'balance :from 'accounts :where (:= 'user-id 1)) |                                                                      |
|                                                           | ; Deferred (:select 'balance :from 'accounts :where (:= 'user-id 1)) |
| Application calculates the balance should be 200          |                                                                      |
| (:update 'accounts :set 'balance 200)                     |                                                                      |
| COMMIT                                                    |                                                                      |
|                                                           | Application calculates the balance should be 100                     |
|                                                           | (:update 'accounts :set 'balance 100)                                |
|                                                           | COMMIT                                                               |

The Session 2 select query notices that the row is already engaged and would be
deferred until Transaction 1 is committed. At that point it reads the
balance (now 200), tells the application, and the application subtracts 100
and tells the database to update the balance to 100.

