doc/isolation-notes.html

<div id="outline-container-orgf85ad33" class="outline-4">
<h4 id="orgf85ad33">Phantom Read</h4>
<div class="outline-text-4" id="text-orgf85ad33">
<p>
A Phantom Read is where a transaction re-executes a query returning a set of
rows and finds that the set of rows has changed (not necessarily row 215,
but some one or more of the rows in the query set). Phantom Reads are
prevented by using the “Repeatable Read” isolation level. Row level locks
will not solve this problem.
</p>

<p>
Assume first select returns 50:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Transaction 1</td>
<td class="org-left">Transaction 2</td>
</tr>

<tr>
<td class="org-left">BEGIN</td>
<td class="org-left">BEGIN</td>
</tr>

<tr>
<td class="org-left">(:select (:count '*) :from 'table1 :where (:= 'region 1))</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">(:insert-into 'table1 :set 'sales 2200))</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">COMMIT;</td>
</tr>

<tr>
<td class="org-left">(:select (:count '*) :from 'table1 :where (:= 'region 1))</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">END</td>
<td class="org-left">END</td>
</tr>
</tbody>
</table>

<p>
The second select will return 51. Depending on what else might be happening in
transaction 1, the difference between the number of rows at the beginning and
the number of rows at the end may cause calculations to be inconsistent
internally to the transaction.
</p>
</div>
</div>

<div id="outline-container-org6803710" class="outline-4">
<h4 id="org6803710">For More Fun</h4>
<div class="outline-text-4" id="text-org6803710">
<p>
Now consider you have banking application A which runs in multiple sessions and
does not use transactions and the user withdraws 100 from each of two sessions
and the balance started at 300.
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Session 1</td>
<td class="org-left">Session 2</td>
</tr>

<tr>
<td class="org-left">(:select 'balance :from 'accounts :where (:= 'user-id 1))</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">(:select 'balance :from 'accounts :where (:= 'user-id 1))</td>
</tr>

<tr>
<td class="org-left">Application calculates the balance should be 200</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">(:update 'accounts :set 'balance 200)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Application calculates the balance should be 200</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">(:update 'accounts :set 'balance 200)</td>
</tr>
</tbody>
</table>

<p>
At this point the application has subtracted 200 (100 in each session), but
the account balance still shows 200. Transactions would not have made a
difference.
</p>

<p>
Now implemented slightly differently:
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Session 1</td>
<td class="org-left">Session 2</td>
</tr>

<tr>
<td class="org-left">(:select 'balance :from 'accounts :where (:= 'user-id 1))</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">(:select 'balance :from 'accounts :where (:= 'user-id 1))</td>
</tr>

<tr>
<td class="org-left">(:update 'accounts :set 'balance (:- 'balance 100))</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">(:update 'accounts :set 'balance (:- 'balance 100))</td>
</tr>
</tbody>
</table>

<p>
Do you know what the balance is now? It should be 100 because you put the
calculation back into the database where it belongs. But life gets more
complicated than these simple examples. Complex queries and updates provide
more possibilities for concurrent transactions to generate conflicting,
leading to solutions such as "row level locking" and "isolation levels".
</p>
</div>
</div>
</div>

<div id="outline-container-orgad0b61f" class="outline-3">
<h3 id="orgad0b61f">Isolation Levels</h3>
<div class="outline-text-3" id="text-orgad0b61f">
<p>
The official postgresql documentation can be found <a href="https://www.postgresql.org/docs/current/static/transaction-iso.html">here</a>.
</p>
</div>

<div id="outline-container-org300588e" class="outline-4">
<h4 id="org300588e">Read Committed Isolation Level</h4>
<div class="outline-text-4" id="text-org300588e">
<p>
Read Committed is the default isolation level in Postgresql. In general
it has the best balance between locking and performance. This isolation level
means that the existing row is read after the transaction is completed but not
yet written. If the row has not changed, then the transaction is executed. If
the row has changed from when it started building the transaction, then it
starts the transaction over again.
</p>

<p>
The “Read Committed” default isolation level is safe when you are concurrently
reading. If there are multiple select statements in a single transaction, each
select statement will have its own snapshot of the database (which might not
be the same if another transaction is concurrently modifying the database).
The “Read Committed” isolation level is not necessarily safe for concurrent
updates. In other words, the concurrent updates would be performed serially,
potentially surprising the user whose commit is overridden. Update and
Delete statements in a “Read Committed” isolation level will create a
snapshot of the database, use that snapshot to find the rows matching the
where clause and then try to lock that row of the snapshot. If any rows are
already locked by an update or delete statement in another transaction, the
update or delete statement will wait for the other transaction to commit or
abort. If it commits, the update or delete will re-evaluate the where clause
on the new version of the row to determine whether it needs to be modified.
</p>

<p>
Assume our banking problem using transactions at the Postgresql default
isolation level of "read committed".
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Session 1</td>
<td class="org-left">Session 2</td>
</tr>

<tr>
<td class="org-left">BEGIN</td>
<td class="org-left">BEGIN</td>
</tr>

<tr>
<td class="org-left">(:select 'balance :from 'accounts :where (:= 'user-id 1))</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">; Deferred (:select 'balance :from 'accounts :where (:= 'user-id 1))</td>
</tr>

<tr>
<td class="org-left">Application calculates the balance should be 200</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">(:update 'accounts :set 'balance 200)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">COMMIT</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Application calculates the balance should be 100</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">(:update 'accounts :set 'balance 100)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">COMMIT</td>
</tr>
</tbody>
</table>

<p>
The Session 2 select query notices that the row is already engaged and would be
deferred until Transaction 1 is committed. At that point it reads the
balance (now 200), tells the application, and the application subtracts 100
and tells the database to update the balance to 100.
</p>
</div>
</div>
