doc/isolation-notes.org
*** Repeatable Read Isolation Level
    :PROPERTIES:
    :ID:       0a28ea38-6eaa-4c66-af5d-518f7f4184fb
    :END:
In Postgresql, a “Repeatable Read” isolation level takes a snapshot of the
current state of the database and all queries in the transaction will use
that snapshot. So if another transaction modifies a row, a second select
statement in a repeatable read isolation level would not be affected because
it is looking solely at the snapshot that was taken at the beginning of the
transaction.

Things happen differently if the transaction using a “Repeatable Read”
isolation level wants to Update or Delete a row.

If a Phantom read is detected when the transaction wants to commit, a
Repeatable Read would go back and re-read the table and repeat the
transaction. Update and Delete statements in a “Repeatable Read” isolation
level will create a snapshot of the database, use that snapshot to find the
rows matching the where clause and then check to see if another transaction
is currently trying to modify the rows  (not just the columns) that the
Update or Delete statement is trying to modify. If the other transaction
aborts, the Update or Delete statement will modify the relevant rows and
continue. If the other transaction commits, then the repeatable read
transaction will abort with an error message about “could not serialize
access due to concurrent update”.

If you are running transaction at isolation level “repeatable read”,
concurrent updates can be expected to trigger query failures  from time
to time that need to be handled, typically by re-running the transaction.
The following error message can be expected:

- “ERROR: could not serialize due to concurrent update” (Under
either “repeatable read” or “serializable”.)

Repeatable read addresses a different problem than our banking problem
above, so the result in this case is the same as "read committed".

*** Serializable Isolation Level
    :PROPERTIES:
    :ID:       65dc3b10-c1d0-41e6-96b1-322b61f99f79
    :END:
The Serializable Isolation level tells postgresql to effectively serialize all
transactions. That ensures validity at the cost of a hit to performance.

If you are running transaction at isolation level “serializable”, concurrent
updates can be expected to trigger query failures  from time to time that
need to be handled, typically by re-running the transaction. The following
two errors can be expected:

- “ERROR: could not serialize due to concurrent update” (Under either “repeatable read” or “serializable”.)

- “ERROR: could not serialize access due to read/write dependencies among transactions. (Under “serializable”).

* For Futher Reading
  :PROPERTIES:
  :ID:       da884a49-4295-486f-b7b5-3c30929d0529
  :END:

- https://www.postgresql.org/docs/current/static/transaction-iso.html
- https://www.postgresql.org/docs/current/static/sql-set-transaction.html
- http://elliot.land/post/sql-transaction-isolation-levels-explained
- https://blog.2ndquadrant.com/postgresql-anti-patterns-read-modify-write-cycles/
- https://dba.stackexchange.com/questions/131226/set-serializable-isolation-for-update-query-postgresql-9-4
- https://www.enterprisedb.com/docs/en/9.0/pg/transaction-iso.html
- https://wiki.postgresql.org/wiki/SSI
- https://dba.stackexchange.com/questions/202775/how-to-write-validation-trigger-which-works-with-all-isolation-levels
- https://stackoverflow.com/questions/45923021/apparent-transaction-isolation-violation-in-postgresql
- https://brandur.org/http-transactions
- https://brandur.org/idempotency-keys
- https://brandur.org/postgres-reads
- http://malisper.me/postgres-transaction-isolation-levels/
- https://begriffs.com/posts/2017-08-01-practical-guide-sql-isolation.html (includes the "zoo" of transaction phenomena)
- http://shiroyasha.io/transaction-isolation-levels-in-postgresql.html
- [[https://www.microsoft.com/en-us/research/wp-content/uploads/2016/02/tr-95-51.pdf][A Critique of ANSI SQL Isolation Levels]]
- [[http://www.cs.umb.edu/~poneil/ROAnom.pdf][A Read-Only Transaction Anomaly Under Snapshot Isolation]]
- [[http://vldb.org/pvldb/vol5/p1850_danrkports_vldb2012.pdf][Serializable Snapshot Isolation in PostgreSQL]]
- [[https://www.postgresql.org/docs/current/static/applevel-consistency.html]]
- [[http://jimgray.azurewebsites.net/papers/thetransactionconcept.pdf][The Transaction Concept: Virtues and Limitations]]
