doc/isolation-notes.html

<div id="outline-container-org281f76a" class="outline-4">
<h4 id="org281f76a">Repeatable Read Isolation Level</h4>
<div class="outline-text-4" id="text-org281f76a">
<p>
In Postgresql, a “Repeatable Read” isolation level takes a snapshot of the
current state of the database and all queries in the transaction will use
that snapshot. So if another transaction modifies a row, a second select
statement in a repeatable read isolation level would not be affected because
it is looking solely at the snapshot that was taken at the beginning of the
transaction.
</p>

<p>
Things happen differently if the transaction using a “Repeatable Read”
isolation level wants to Update or Delete a row.
</p>

<p>
If a Phantom read is detected when the transaction wants to commit, a
Repeatable Read would go back and re-read the table and repeat the
transaction. Update and Delete statements in a “Repeatable Read” isolation
level will create a snapshot of the database, use that snapshot to find the
rows matching the where clause and then check to see if another transaction
is currently trying to modify the rows  (not just the columns) that the
Update or Delete statement is trying to modify. If the other transaction
aborts, the Update or Delete statement will modify the relevant rows and
continue. If the other transaction commits, then the repeatable read
transaction will abort with an error message about “could not serialize
access due to concurrent update”.
</p>

<p>
If you are running transaction at isolation level “repeatable read”,
concurrent updates can be expected to trigger query failures  from time
to time that need to be handled, typically by re-running the transaction.
The following error message can be expected:
</p>

<ul class="org-ul">
<li>“ERROR: could not serialize due to concurrent update” (Under</li>
</ul>
<p>
either “repeatable read” or “serializable”.)
</p>

<p>
Repeatable read addresses a different problem than our banking problem
above, so the result in this case is the same as "read committed".
</p>
</div>
</div>

<div id="outline-container-orgeaaa3de" class="outline-4">
<h4 id="orgeaaa3de">Serializable Isolation Level</h4>
<div class="outline-text-4" id="text-orgeaaa3de">
<p>
The Serializable Isolation level tells postgresql to effectively serialize all
transactions. That ensures validity at the cost of a hit to performance.
</p>

<p>
If you are running transaction at isolation level “serializable”, concurrent
updates can be expected to trigger query failures  from time to time that
need to be handled, typically by re-running the transaction. The following
two errors can be expected:
</p>

<ul class="org-ul">
<li>“ERROR: could not serialize due to concurrent update” (Under either “repeatable read” or “serializable”.)</li>

<li>“ERROR: could not serialize access due to read/write dependencies among transactions. (Under “serializable”).</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org0f0efcd" class="outline-2">
<h2 id="org0f0efcd">For Futher Reading</h2>
<div class="outline-text-2" id="text-org0f0efcd">
<ul class="org-ul">
<li><a href="https://www.postgresql.org/docs/current/static/transaction-iso.html">https://www.postgresql.org/docs/current/static/transaction-iso.html</a></li>
<li><a href="https://www.postgresql.org/docs/current/static/sql-set-transaction.html">https://www.postgresql.org/docs/current/static/sql-set-transaction.html</a></li>
<li><a href="http://elliot.land/post/sql-transaction-isolation-levels-explained">http://elliot.land/post/sql-transaction-isolation-levels-explained</a></li>
<li><a href="https://blog.2ndquadrant.com/postgresql-anti-patterns-read-modify-write-cycles/">https://blog.2ndquadrant.com/postgresql-anti-patterns-read-modify-write-cycles/</a></li>
<li><a href="https://dba.stackexchange.com/questions/131226/set-serializable-isolation-for-update-query-postgresql-9-4">https://dba.stackexchange.com/questions/131226/set-serializable-isolation-for-update-query-postgresql-9-4</a></li>
<li><a href="https://www.enterprisedb.com/docs/en/9.0/pg/transaction-iso.html">https://www.enterprisedb.com/docs/en/9.0/pg/transaction-iso.html</a></li>
<li><a href="https://wiki.postgresql.org/wiki/SSI">https://wiki.postgresql.org/wiki/SSI</a></li>
<li><a href="https://dba.stackexchange.com/questions/202775/how-to-write-validation-trigger-which-works-with-all-isolation-levels">https://dba.stackexchange.com/questions/202775/how-to-write-validation-trigger-which-works-with-all-isolation-levels</a></li>
<li><a href="https://stackoverflow.com/questions/45923021/apparent-transaction-isolation-violation-in-postgresql">https://stackoverflow.com/questions/45923021/apparent-transaction-isolation-violation-in-postgresql</a></li>
<li><a href="https://brandur.org/http-transactions">https://brandur.org/http-transactions</a></li>
<li><a href="https://brandur.org/idempotency-keys">https://brandur.org/idempotency-keys</a></li>
<li><a href="https://brandur.org/postgres-reads">https://brandur.org/postgres-reads</a></li>
<li><a href="http://malisper.me/postgres-transaction-isolation-levels/">http://malisper.me/postgres-transaction-isolation-levels/</a></li>
<li><a href="https://begriffs.com/posts/2017-08-01-practical-guide-sql-isolation.html">https://begriffs.com/posts/2017-08-01-practical-guide-sql-isolation.html</a> (includes the "zoo" of transaction phenomena)</li>
<li><a href="http://shiroyasha.io/transaction-isolation-levels-in-postgresql.html">http://shiroyasha.io/transaction-isolation-levels-in-postgresql.html</a></li>
<li><a href="https://www.microsoft.com/en-us/research/wp-content/uploads/2016/02/tr-95-51.pdf">A Critique of ANSI SQL Isolation Levels</a></li>
<li><a href="http://www.cs.umb.edu/~poneil/ROAnom.pdf">A Read-Only Transaction Anomaly Under Snapshot Isolation</a></li>
<li><a href="http://vldb.org/pvldb/vol5/p1850_danrkports_vldb2012.pdf">Serializable Snapshot Isolation in PostgreSQL</a></li>
<li><a href="https://www.postgresql.org/docs/current/static/applevel-consistency.html">https://www.postgresql.org/docs/current/static/applevel-consistency.html</a></li>
<li><a href="http://jimgray.azurewebsites.net/papers/thetransactionconcept.pdf">The Transaction Concept: Virtues and Limitations</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
